v2506/run/verification1/template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../settings"

scale       1;
halfAngle   1;

x           #eval "$R * cos(degToRad($halfAngle))";
z           #eval "$R * sin(degToRad($halfAngle))";
z_neg       #eval "-1 * $z";

vertices
(
    (0  0 0)            //0
    ($x 0 $z_neg)       //1
    ($x $l $z_neg)      //2
    (0 $l 0)            //3
    ($x 0 $z)           //4
    ($x $l $z)          //5
);

blocks
(
    hex (0 1 2 3 0 4 5 3) ($n_R $n_z 1) simpleGrading (1 1 1)
);

edges
(
    arc 1 4 ($R 0 0)
    arc 2 5 ($R $z 0)
);

boundary
(
    origo
    {
        type empty;
        faces
        (
            (0 3 3 0)
        );
    }

    farfield
    {
        type wall;
        faces
        (
            (1 2 5 4)
        );
    }

    lower_inner
    {
        type patch;
        faces
        (
            (0 1 4 0)
        );
    }
    upper_inner
    {
        type patch;
        faces
        (
            (2 3 3 5)
        );
    }

    wedge_lower
    {
        type wedge;
        faces
        (  
            (0 3 2 1)
        );
    }

    wedge_upper
    {
        type wedge;
        faces
        (
            (0 4 5 3)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
