v2506/run/verification1/template/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    farfield
    {
        type            zeroGradient;
        value           $internalField;
    }
    lower_inner
    {
        type            zeroGradient;
        value           $internalField;
    }
    upper_inner
    {       
        type            fixedValue;
        value           $internalField;
    }
    "wedge.*"
    {
        type            wedge;
    }
}

// ************************************************************************* //
