v2506/run/verification1/template/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../settings"

expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

        constants
        {
            R $R;
            U_avg $U_avg;
        }
        
        expression
        #{
            vector(0, 2*$[(scalar)constants.U_avg] * (1.0 - pos().x()*pos().x()/$[(scalar)constants.R]/$[(scalar)constants.R]) ,0)
        #};
    }
);


// ************************************************************************* //